Connect to Postgres database using the sqlalchemy library

Install `sqlalchemy` and `psycopg2` libraries

In [34]:
from sqlalchemy import create_engine, MetaData, Table 
import pandas as pd
import geopandas as gpd
import folium
from matplotlib import pyplot as plt
import seaborn as sns

First, we need to create a connection string. The format is

 ```<dialect(+driver)>://<username>:<password>@<hostname>:<port>/<database>```

To connect to the Lahman baseball database, you can use the following connection string.

In [35]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/scooters"

Now, we need to create an engine and use it to connect.

In [36]:
engine = create_engine(connection_string)

In [37]:
# get column info on scooters table 
metadata = MetaData()
scooters = Table('scooters', metadata, autoload=True, autoload_with=engine)
print(repr(scooters))
trips = Table('trips', metadata, autoload=True, autoload_with=engine)
print(repr(trips))

Table('scooters', MetaData(), Column('pubdatetime', TIMESTAMP(), table=<scooters>), Column('latitude', NUMERIC(), table=<scooters>), Column('longitude', NUMERIC(), table=<scooters>), Column('sumdid', TEXT(), table=<scooters>), Column('sumdtype', TEXT(), table=<scooters>), Column('chargelevel', NUMERIC(), table=<scooters>), Column('sumdgroup', TEXT(), table=<scooters>), Column('costpermin', NUMERIC(), table=<scooters>), Column('companyname', TEXT(), table=<scooters>), schema=None)
Table('trips', MetaData(), Column('pubtimestamp', TIMESTAMP(), table=<trips>), Column('companyname', TEXT(), table=<trips>), Column('triprecordnum', TEXT(), table=<trips>), Column('sumdid', TEXT(), table=<trips>), Column('tripduration', NUMERIC(), table=<trips>), Column('tripdistance', NUMERIC(), table=<trips>), Column('startdate', DATE(), table=<trips>), Column('starttime', TIME(), table=<trips>), Column('enddate', DATE(), table=<trips>), Column('endtime', TIME(), table=<trips>), Column('startlatitude', NUMERIC(), table=<trips>), Column('startlongitude', NUMERIC(), table=<trips>), Column('endlatitude', NUMERIC(), table=<trips>), Column('endlongitude', NUMERIC(), table=<trips>), Column('triproute', TEXT(), table=<trips>), Column('create_dt', TIMESTAMP(), table=<trips>), schema=None)

Now, we can create our query and pass it into the `.query()` method.

In [38]:
query = '''
SELECT MIN(pubdatetime), MAX(pubdatetime)
FROM scooters;
'''

result = engine.execute(query)

In [39]:
date_range = pd.read_sql(query, con = engine)
date_range.head()

                      min                 max
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [40]:
# looking for null values, not sure how to do this without doing it column by column, tbd
query1 = '''
SELECT COUNT(*)
FROM trips
WHERE enddate IS NULL
'''

result1 = engine.execute(query1)

For much more information about SQLAlchemy and to see a more “Pythonic” way to execute queries, see Introduction to Databases in Python: https://www.datacamp.com/courses/introduction-to-relational-databases-in-python

In [41]:
null_trips = pd.read_sql(query1, con = engine)
null_trips.head()

   count
0      0

What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [42]:
query2 = '''
SELECT MIN(tripduration) as min_duration, MAX(tripduration) as max_duration
FROM trips;
'''
result = engine.execute(query2)

In [43]:
trip_range = pd.read_sql(query2, con = engine)
trip_range.head()

   min_duration  max_duration
0    -19.358267      512619.0

In [44]:
duration_outliers = '''
SELECT companyname, sumdid, tripduration, tripdistance, startdate, enddate 
FROM trips
WHERE tripduration in (
    SELECT MIN(tripduration)
    FROM trips
);
'''
result = engine.execute(duration_outliers)

In [45]:
outliers = pd.read_sql(duration_outliers, con = engine)
outliers.head()

,companyname,sumdid,tripduration,tripdistance,startdate,enddate
0,Lyft,Powered853770,-19.358267,4540.68256,2019-07-19,2019-07-18

In [46]:
duration_outliers2 = '''
SELECT companyname, sumdid, tripduration, tripdistance, startdate, enddate 
FROM trips
WHERE tripduration in (
    SELECT MAX(tripduration)
    FROM trips
);
'''
result = engine.execute(duration_outliers2)

In [47]:
outliers2 = pd.read_sql(duration_outliers2, con = engine)
outliers2.head()

,companyname,sumdid,tripduration,tripdistance,startdate,enddate
0,Bolt Mobility,Powered-2763482f-d784-4797-7cf9-59346940451d,512619.0,95505.25,2019-07-10,2019-07-16

# 1. During this period, seven companies offered scooters.
How many scooters did each company have in this time frame?Did the number 
for each company change over time? Did scooter usage vary by company?

In [ ]:
# sql to pull month from pubdatetime, company name, count sumdid.
num_of_scooters_over_time = '''
SELECT EXTRACT(MONTH FROM pubdatetime) as month, companyname, COUNT(DISTINCT sumdid) as scooter_count
FROM scooters
Group BY month, companyname;
'''
result = engine.execute(num_of_scooters_over_time)

count_each_company_time = pd.read_sql(num_of_scooters_over_time, con = engine)
count_each_company_time.head()

In [ ]:
pivot_df = count_each_company_time.pivot(index='month', columns='companyname', values='scooter_count')
pivot_df

In [ ]:
sns.set_theme(style="darkgrid")
# Plot the responses for different events and regions
sns.lineplot(data=pivot_df)

In [ ]:
# trying matplotlib instead of seaborn

plt.plot(pivot_df)
plt.xlabel("Month")
plt.ylabel("Scooter Count")
plt.title("Scooter Count Over Time", loc='left', fontsize=12, fontweight=0, color='blue')
plt.show()

# 2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule?

In [ ]:
trips_out_of_compliance = '''
SELECT companyname, COUNT(sumdid)
FROM trips
WHERE tripduration > 1440 OR tripduration < 1
GROUP BY companyname
'''
result = engine.execute(trips_out_of_compliance)

t_oo_c = pd.read_sql(trips_out_of_compliance, con = engine)
t_oo_c